In [2]:
import numpy as np
import pandas as pd

In [4]:
data = {
    'A' : [1, 2, np.nan],
    'B' : [5, np.nan, np.nan],
    'C' : [1, 2, 3]
}

df = pd.DataFrame(data)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [14]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [16]:
df.fillna(value = "TOKYO IS BAE")

              A             B  C
0           1.0           5.0  1
1           2.0  TOKYO IS BAE  2
2  TOKYO IS BAE  TOKYO IS BAE  3

In [19]:
df['A'].fillna(value = df['B'].sum())

0    1.0
1    2.0
2    5.0
Name: A, dtype: float64